{
  "survey": {
    "have work experience": [
      "Tell me about your job. What kind of work did you do, and what were your main responsibilities?",
      "Can you describe a memorable project or work experience you had? Please give me some details.",
      "Have you ever faced a difficult problem at work? Tell me about the situation and how you handled it",
      "Have you ever made a mistake at work? What did you learn from it, and how did you overcome it?",
      "How were your relationships with your boss or coworkers? Tell me about a time you had a conflict and how you resolved it.",
      "What did you do to improve your work efficiency? Can you give me a specific example?"
    ],
    "living alone in a house/apartment": [
      "What is the biggest challenge of living alone?",
      "How do you handle household repairs and maintenance on your own?",
      "How do you manage your budget and finances for groceries and other household expenses?",
      "How do you personalize your living space to make it feel more like your own?",
      "What are your usual routines on a typical weekday evening when you are home alone?",
      "Tell me about the biggest change in your lifestyle since you started living alone.",
      "How do you handle unexpected situations or emergencies when you're by yourself?"
    ],
    "living with friends in a house/apartment": [
      "I'd like to know about your best friend. Who is she or he? What does she or he look like? Describe your best friend in as much detail as you can.",
      "What are the most important qualities in a roommate?",
      "Tell me about the best part of living with your friends. What makes it so enjoyable?",
      "How do you and your roommates handle disagreements or conflicts?",
      "Describe a memorable experience you had with your roommates.",
      "What are some of the rules or boundaries you have with your friends?",
      "How do you balance your personal space with the communal living area?",
      "Tell me about a challenge you faced while living with friends and how you resolved it.",
      "What are some of the best memories you have of living with your friends?",
      "Tell me about a time you had to make a big decision together with your friends about your living situation."
    ],
    "living with family in a house/apartment": [
      "Tell me about all the household chores you are in charge of. What are they? How do you carry out your responsibility?",
      "What is the best part about living with your family?",
      "How do you handle disagreements with family members?",
      "Describe a typical family dinner. What do you usually talk about?",
      "What are some of the family traditions that are important to you?",
      "How do you balance your personal life with family obligations?"
    ],
    "dormitory": [
      "What's a typical day like in your dorm?",
      "Describe your roommate. What are some of the pros and cons of living with them?",
      "What do you like most about living in a dormitory?",
      "What is the biggest advantage of living in a dorm?",
      "How do you manage your privacy in a shared dorm room?",
      "Tell me about a time you had to deal with a noisy neighbor.",
      "What are some of the social events or activities that happen in your dorm?",
      "Describe the communal areas in your dorm. What do they look like and what are they used for?",
      "How do you handle studying when there are distractions in the dorm?",
      "What's your favorite meal from the dorm cafeteria or a nearby eatery?",
      "What advice would you give to someone who is about to move into a dorm for the first time?",
      "How do you personalize your dorm room to make it feel more like your own space?",
      "How do you and your roommate handle guests coming over?",
      "Tell me about a time when you and your roommate had to compromise on something.",
      "What's the best part about the location of your dorm?",
      "Have you made any close friends in your dorm? Tell me about them.",
      "What is the most difficult rule to follow in your dorm and why?",
      "Describe the process of moving into your dorm for the first time.",
      "How do you handle the cost of living in a dormitory?"
    ],
    "military barracks": [
      "Tell me about the last time you had a day off at the barracks. What did you do?",
      "What is the most difficult thing about living in the barracks?",
      "Describe the living conditions in your barracks. What does your room look like?",
      "What is the daily routine like in the barracks, from morning until night?",
      "How do you spend your free time when you're not on duty?",
      "Tell me about the food in the mess hall. What are your favorite and least favorite meals?",
      "What kind of rules or regulations do you have to follow in the barracks?",
      "How do you handle personal privacy when living in a shared space?",
      "Describe a memorable experience you've had with your fellow soldiers or bunkmates.",
      "What is the biggest challenge of adapting to barracks life?",
      "How do you keep in touch with your family and friends while you're at the barracks?",
      "Tell me about a time you had to help a fellow soldier with a problem.",
      "What's the best part about being in the military barracks?",
      "Describe the process of getting a day pass or leave from the barracks.",
      "What's one thing you wish you could change about living in the barracks?",
      "How do you handle stress and stay motivated in that environment?",
      "Tell me about a time you learned an important lesson while living in the barracks.",
      "What kind of facilities or recreational areas are available to you?"
    ],
    "student": [
      "You indicated in the survey that you go to school. Tell me about your school.",
      "Tell me about your favorite professor. What does he or she look like? Why do you like him or her?",
      "I'd like to know about your typical day at school. What do you do when you go to school? Tell me in detail.",
      "What is the most interesting class you are taking right now, and why do you find it interesting?",
      "Describe a challenging project or assignment you had to complete for school. How did you handle it?",
      "What kind of extracurricular activities or clubs are you involved in at school?",
      "How do you typically prepare for exams or presentations?",
      "Tell me about a memorable event or experience you've had on your campus.",
      "How do you balance your social life with your academic responsibilities?",
      "What's your favorite spot on campus to study or hang out?",
      "Describe the campus environment and atmosphere. What is it like?",
      "What's one thing you would change about your school if you could?",
      "How has going to school changed you as a person?",
      "Tell me about a time you collaborated with other students on a project.",
      "What are your future goals after you finish your education?",
      "Describe a time you received a good grade on a difficult test or paper.",
      "How do you handle stress related to your studies?",
      "What is the biggest advantage of being a student?"
    ],
    "museum": [
      "When was the last time you went to a museum? What did you see there, and what was the most memorable piece or exhibit?",
      "Tell me about your favorite type of museum. Why do you enjoy visiting this kind of museum, and how do you feel when you are there?",
      "Describe a memorable experience you had at a museum. What happened, and why was it so special to you?",
      "What's the biggest difference between visiting an art museum and a science museum?",
      "How do you usually choose which museum to visit?",
      "Tell me about a museum that you would like to visit in the future.",
      "What do you think is the purpose of museums in society today?",
      "Have you ever been on a museum tour with a guide? What was that experience like?",
      "Describe a time you learned something surprising or unexpected at a museum.",
      "What's the atmosphere like in the museums you've visited?",
      "Do you prefer to go to museums alone or with friends or family? Why?",
      "Tell me about your most and least favorite museum exhibits you've seen.",
      "What kind of museum would you create if you could? What would be in it?",
      "How has your perspective on art or history changed after visiting a museum?",
      "Do you think museums should be free for everyone? Why or why not?",
      "What's the best advice you'd give to someone visiting a museum for the first time?",
      "Tell me about a historical artifact or piece of art you saw that left a lasting impression on you.",
      "How do you feel when you're surrounded by history or art in a museum?"
    ],
    "watching sports": [
      "What is your favorite sport to watch? Tell me about your favorite team or player, and why you like to watch them play.",
      "Do you prefer watching sports at home on TV or going to a stadium? What are the pros and cons of each, and what was your last experience like?",
      "Tell me about the last time you watched a live sporting event. Who were you with, and what was the atmosphere like?",
      "How did you first get interested in watching sports?",
      "What's your favorite part of watching a game? Is it the competition, the strategy, or something else?",
      "Describe a memorable moment you've seen in a sporting event, like a game-winning shot or a come-from-behind victory.",
      "Do you watch any sports with your family? What's that experience like?",
      "Tell me about a time you were disappointed by the outcome of a game you were watching.",
      "What kind of snacks or food do you usually have when you're watching a game?",
      "How do you keep up with the scores and news of your favorite teams?",
      "What's the most exciting game you've ever watched?",
      "Do you think watching sports on TV is better than being there in person? Why or why not?",
      "Tell me about a time you cheered for a team that you don't normally support.",
      "What's the atmosphere like when you watch a game with a large group of people?",
      "How do you feel when your favorite team wins? What about when they lose?",
      "Do you have a sports rivalry? Tell me about it.",
      "What's one sport you don't enjoy watching and why?",
      "Tell me about your earliest memory of watching a sporting event."
    ],
    "TV": [
      "What TV shows are you watching these days? Describe the show, and tell me why you find it so interesting.",
      "Tell me about a TV show you've watched from the very first episode. What was it about, and what made you want to keep watching it?",
      "What is your favorite TV genre? Why do you enjoy it, and can you give me an example of a show you love in that genre?",
      "Do you prefer to watch shows that have already finished, or shows that are currently airing? Why?",
      "Tell me about a time you binge-watched a TV show. What was it, and how did you feel afterwards?",
      "What's the biggest difference between TV shows today and TV shows from your childhood?",
      "Who is your favorite actor or actress from a TV show, and why do you like them?",
      "Describe a TV show that you think is overrated, and explain why you feel that way.",
      "How do you typically find new TV shows to watch?",
      "Tell me about a TV show that made you feel emotional, like making you laugh or cry.",
      "Do you watch TV shows on a regular TV, or do you stream them online? What are the pros and cons of each?",
      "What's one TV show you would recommend to a friend, and why?",
      "Tell me about a time you were surprised by the ending of a TV show.",
      "What kind of shows do you usually watch with your family or friends?",
      "How do you think TV shows have changed over the last 10 years?",
      "Do you prefer comedy, drama, or a different genre? Why?",
      "What is a TV show that you started watching but never finished? Why?",
      "Tell me about a TV show that taught you something new."
    ],
    "watching cooking programs": [
      "What's your favorite cooking show? Describe the show and tell me what you like about it, and if you have ever tried to cook a recipe from it.",
      "Have you ever tried to make a dish you saw on a cooking show? Tell me about that experience—what did you make, and how did it turn out?",
      "Do you think watching cooking programs has made you a better cook? Why or why not, and what is one thing you've learned from a cooking show?",
      "What's the biggest difference between a reality cooking show and a documentary-style cooking show?",
      "How do you feel when you watch a cooking show? Does it make you hungry or inspired?",
      "Tell me about a time you tried a recipe from a cooking show and it was a complete failure.",
      "Who is your favorite TV chef or cooking show host, and why do you like them?",
      "Do you watch cooking shows for entertainment, or to learn new recipes and techniques?",
      "What's one specific recipe you learned from a cooking show that you now make regularly?",
      "Describe a cooking show that focuses on a type of food you love.",
      "Have you ever seen a cooking show about food from your home country? What was it like?",
      "What do you think is the best part of watching a cooking show?",
      "Tell me about a time you cooked something for someone special that you learned from a cooking show.",
      "Do you prefer watching cooking competitions or more casual cooking demonstrations? Why?",
      "What's one thing you wish cooking shows would do more often?",
      "How do you think cooking shows have changed the way people think about food?",
      "Tell me about the most memorable dish you've seen on a cooking program.",
      "Do you think it's important for cooking shows to focus on healthy food?"
    ],
    "driving": [
      "Tell me about your first driving experience. Who taught you, and how did you feel when you were behind the wheel for the first time?",
      "How do you feel about traffic and how do you handle it? What are some things you do to pass the time when you're stuck in a traffic jam?",
      "Describe a memorable road trip you've taken. Where did you go, who did you go with, and what made the trip so special?",
      "What do you like most about driving? Is it the freedom, the convenience, or something else?",
      "How do you feel about driving in different weather conditions, like rain or snow?",
      "Tell me about a time you had a problem with your car while driving. What happened, and how did you solve it?",
      "What's your favorite music or podcast to listen to while you're driving?",
      "Describe the traffic in your city. What are the pros and cons?",
      "What's the most scenic drive you've ever taken? Tell me about the landscape and the atmosphere.",
      "How has driving changed your daily life?",
      "Tell me about a time you got lost while driving. How did you find your way back?",
      "What are some of the most important rules of the road that every driver should follow?",
      "Do you have a preference for automatic or manual transmission cars? Why?",
      "What's the longest you've ever driven in one day? What was that experience like?",
      "How do you handle road rage or aggressive drivers?",
      "Describe a time you helped someone with a car problem, like changing a flat tire.",
      "What's the first place you would go on a road trip if you had a week off?",
      "Do you think driving is a necessary skill for everyone? Why or why not?"
    ],
    "club": [
      "Tell me about the last time you went to a club. Who did you go with, what did you do, and what was the music like?",
      "What is your favorite part about going to a club? Do you like the music, the dancing, or just being with friends?",
      "What kind of music do you like to listen to at a club, and what makes a club a good one for you?",
      "Describe the atmosphere of a club you've been to. What does it look like?",
      "How do you decide which club to go to?",
      "What's the biggest difference between going to a club and a bar or pub?",
      "Tell me about a time you had a great conversation with a stranger at a club.",
      "How do you stay safe when you're at a club?",
      "What's your favorite thing to wear when you go out to a club?",
      "Tell me about a time you tried to dance but felt embarrassed. What happened?",
      "Do you prefer big, crowded clubs or smaller, more intimate ones? Why?",
      "What's your favorite song to dance to at a club?",
      "Describe a time you went to a club for a special occasion, like a birthday.",
      "How do you get home after a night out at the club?",
      "What are some of the pros and cons of going to clubs?",
      "Have you ever seen a live performance by a DJ at a club? What was it like?",
      "Tell me about the best part of the nightlife in your city.",
      "What's the most common type of music played in the clubs you've been to?"
    ],
    "park": [
      "Tell me about a park you often visit. Where is it located, what does it look like, and what do you usually do there?",
      "What is the best part of the park you usually go to? Describe the atmosphere and how it makes you feel.",
      "Describe a memorable experience you had at a park. What happened, and why was it so memorable?",
      "What kind of facilities does your favorite park have? Are there benches, playgrounds, or walking trails?",
      "How often do you go to the park, and what time of day do you usually go?",
      "Tell me about the last time you went to a park with your friends or family.",
      "What is the biggest difference between a city park and a national park?",
      "Do you prefer to go to the park when it's crowded or when it's quiet? Why?",
      "What's your favorite season to visit the park, and what do you do there during that time?",
      "Describe the sounds and smells you experience when you're in the park.",
      "How do you think parks contribute to the well-being of a community?",
      "Tell me about a time you had a picnic or a meal at a park.",
      "What's one thing you would change about your favorite park?",
      "Have you ever seen any wildlife in the park? What did you see?",
      "What kind of activities do you see other people doing at the park?",
      "Tell me about a time you went to a park to relax and clear your head.",
      "What's your favorite kind of tree or plant in the park?",
      "Do you think it's important for cities to have more parks?"
    ],
    "Improving living space": [
      "What was the last thing you did to improve your living space? Describe the project and tell me how it turned out.",
      "Tell me about a time you tried to improve your living space but it didn't go as planned. What happened, and what did you learn from the experience?",
      "If you could make one improvement to your home right now, what would it be? Why would you choose that specific improvement?",
      "What's the biggest challenge you face when trying to improve your living space?",
      "How has a recent improvement to your home changed your daily life?",
      "Tell me about a time you redecorated a room. What did you do, and why did you make those changes?",
      "What kind of a budget do you set for home improvement projects?",
      "Do you prefer to do home improvements yourself or hire a professional? Why?",
      "Tell me about a time you received help from a friend or family member for a home improvement project.",
      "What's a home improvement project you've always wanted to do but haven't yet?",
      "Describe the process of a home improvement project, from planning to completion.",
      "How do you find inspiration for new ways to improve your home?",
      "What's the best piece of advice you've received about home improvements?",
      "Tell me about a time you had to fix a mistake you made during a home improvement project.",
      "Do you think home improvements are more about function or aesthetics?",
      "What is the most common home improvement project in your neighborhood?",
      "How do you feel after you've successfully completed a project to improve your living space?",
      "Tell me about a time you found a creative solution to a problem in your home."
    ],
    "texting friends": [
      "How often do you text your friends and what do you usually talk about? Describe a typical text conversation you have.",
      "Tell me about the last time you had a funny conversation with a friend through text messages. What did you talk about, and what made it so funny?",
      "Do you prefer texting or calling your friends, and why? What are the advantages of each method for you?",
      "What are some common emojis or abbreviations you use when you text?",
      "How do you feel about group chats with your friends? What are the pros and cons?",
      "Tell me about a time you had to text a friend to cancel plans. How did you do it?",
      "Do you ever use voice messages when you text? Why or why not?",
      "What's the biggest difference between texting and face-to-face conversations?",
      "Describe a time when you had to have a serious conversation with a friend over text.",
      "How has texting changed the way you communicate with your friends?",
      "Tell me about a time you sent a text to the wrong person. What happened?",
      "Do you think texting has made you closer to your friends or not? Why?",
      "What is the longest text conversation you've ever had?",
      "Do you prefer texting or other social media apps to communicate with friends?",
      "What is the etiquette you follow when texting, especially when it comes to quick replies?",
      "Tell me about a time a friend sent you a text that made your day.",
      "How do you decide what information to share through text messages versus in person?",
      "What's the most common topic you discuss with your friends via text?"
    ],
    "watching reality shows": [
      "What is your favorite reality show and what do you like about it? Tell me about the plot or concept of the show.",
      "Tell me about a reality show you've watched that taught you something new. What did you learn, and how did it change your perspective?",
      "Why do you think so many people are interested in reality shows? What do you think is the appeal, and what's your opinion on them?",
      "What's the biggest difference between a reality show and a scripted drama?",
      "Do you think reality shows are truly 'real'? Why or why not?",
      "Tell me about a time you were emotionally invested in a reality show. What was the situation?",
      "What's your favorite type of reality show genre? (e.g., dating, cooking, competition, docu-series)",
      "Who is your favorite contestant or personality from a reality show, and why do you like them?",
      "Have you ever talked with your friends about a reality show you were watching? What did you talk about?",
      "What's a reality show you started watching but got tired of? Why did you stop?",
      "Tell me about a time you were surprised by the outcome of a reality show.",
      "Do you think reality shows have any positive impact on society?",
      "What's one thing you would change about your favorite reality show?",
      "Describe the last reality show you watched with your family or friends.",
      "How do you think reality TV has changed over the past decade?",
      "Tell me about a reality show that focuses on a profession or hobby that you find interesting.",
      "What's the most memorable moment you've seen on a reality show?",
      "Do you think it's fair for reality TV contestants to be judged so harshly?"
    ],
    "spa/massage shop": [
      "Tell me about the last time you went to a spa or massage shop. What kind of service did you get, and how did you feel afterwards?",
      "What do you like most about going to a spa? Is it the relaxation, the treatments, or the overall atmosphere?",
      "How often do you visit a spa or massage shop, and what benefits do you get from it? Describe your routine and how it affects your health.",
      "What's the biggest difference between a spa and a massage shop?",
      "Tell me about the atmosphere of your favorite spa. What does it look like, and what kind of music do they play?",
      "How do you choose which spa or massage shop to go to?",
      "Have you ever received a gift certificate to a spa? What was that experience like?",
      "What is your favorite type of massage? Why do you prefer it?",
      "Describe a time you went to a spa to de-stress after a particularly busy week.",
      "Do you prefer to go to the spa alone or with friends or a partner? Why?",
      "Tell me about a time you had a bad experience at a spa or massage shop. What happened?",
      "What's the best part about the treatments you get at a spa?",
      "How do you feel mentally and physically after a good massage?",
      "What are some of the most popular services offered at the spas you've been to?",
      "Do you think going to a spa is a luxury or a necessity for your well-being?",
      "Tell me about a time you tried a new treatment at a spa. What was it, and how did it feel?",
      "What kind of products do they use at your favorite spa?",
      "How do you book appointments at a spa or massage shop?"
    ],
    "camping": [
      "Tell me about the last time you went camping. Where did you go, who did you go with, and what activities did you do?",
      "What do you like most about camping? Is it being close to nature, cooking outdoors, or something else?",
      "What are some of the pros and cons of camping? Tell me about the biggest challenge you've faced while camping.",
      "What's the biggest difference between camping in a tent and camping in an RV?",
      "Describe the process of setting up a campsite, from pitching the tent to starting a fire.",
      "What kind of food do you usually cook when you go camping? Tell me about a favorite meal.",
      "Tell me about a time you had to deal with bad weather while camping. What happened?",
      "Do you prefer camping in a remote area or at a more developed campsite? Why?",
      "What are some of the essential items you always bring with you when you go camping?",
      "Describe the atmosphere around a campfire at night. What do you do there?",
      "What's the most memorable view or landscape you've seen while camping?",
      "How do you handle hygiene and staying clean when you're camping?",
      "Have you ever seen any wildlife while camping? What did you see?",
      "What's one thing you would change about your last camping trip?",
      "Do you think camping is a good way to escape from the stress of daily life? Why or why not?",
      "Tell me about a time you went camping with your family when you were a child.",
      "What kind of activities do you enjoy doing during the day while camping?",
      "How do you feel when you wake up in the morning in a tent?"
    ],
    "performance": [
      "Tell me about a memorable performance you've seen. What was it, who was performing, and what made it so unforgettable?",
      "What kind of performances do you like to watch? Do you prefer concerts, plays, or something else, and why?",
      "Do you prefer to watch live performances or recorded ones? What's the biggest difference for you, and what was your last experience like?",
      "How do you typically find out about upcoming performances you might want to see?",
      "What's the biggest difference between seeing a big-budget show and a smaller, local one?",
      "Describe a time you saw a performance that you didn't enjoy. What happened?",
      "Tell me about a time you went to a performance with a friend or family member. What was the experience like?",
      "What is the most exciting part about a live performance?",
      "What kind of atmosphere do you prefer at a performance? Do you like it loud and energetic, or quiet and focused?",
      "Tell me about the best seat you've ever had at a performance. What was your view like?",
      "Have you ever met a performer after a show? What was that experience like?",
      "What's one performance you would love to see in the future?",
      "Do you think live performances are an important part of our culture? Why or why not?",
      "Describe the last time you bought tickets for a performance. How was the process?",
      "What kind of snacks or drinks do you get when you go to a performance?",
      "Tell me about a time a performance surprised you in a good way.",
      "How do you feel when the lights go down and a performance is about to begin?",
      "What's the biggest difference between watching a movie and a live play?"
    ],
    "bar/pub": [
      "Tell me about a memorable experience you had at a bar or pub. Who were you with, and what made it so special?",
      "What is your favorite kind of drink to have at a bar? Tell me what it is, and why you like it.",
      "Do you prefer to go to a bar alone or with friends? Why, and what is the atmosphere like when you go?",
      "What's the biggest difference between a bar and a pub?",
      "Describe the atmosphere of your favorite bar. What does it look like, and what kind of music do they play?",
      "How do you typically choose a bar or pub to go to?",
      "Tell me about a time you met someone interesting at a bar.",
      "What kind of food do you like to eat at a bar or pub?",
      "Do you prefer a quiet bar where you can talk, or a lively bar with music and dancing?",
      "What's your favorite drink to order when you're trying something new?",
      "Describe the last time you went to a bar to celebrate a special occasion.",
      "How do you handle your transportation after a night out at a bar?",
      "What's one thing you would change about your favorite bar?",
      "Tell me about a time you went to a bar that had a live band or musician.",
      "Do you have a favorite spot to sit at the bar?",
      "What do you and your friends usually talk about when you're at a bar?",
      "How do you feel when you're in a bar with a good atmosphere?",
      "What's your favorite kind of bar snack, like peanuts or chips?"
    ],
    "billiard": [
      "How often do you play billiards? Who do you usually play with, and what do you like most about the game?",
      "Describe a memorable game of billiards you've played. What happened, and who did you play against?",
      "What are some of the challenges of playing billiards? Do you think it's a game of skill, luck, or both?",
      "How did you first learn to play billiards?",
      "Tell me about a time you won a particularly difficult game of billiards.",
      "Do you prefer playing pool, snooker, or another type of billiards? Why?",
      "What's the atmosphere like in the billiard hall or pub where you play?",
      "Describe the equipment you use to play billiards. Do you have a favorite cue?",
      "What's the most common mistake you see beginners make when they play billiards?",
      "Tell me about a time you taught someone how to play billiards.",
      "How do you feel when you make a difficult shot in billiards?",
      "What's your favorite billiards trick shot?",
      "Do you think billiards is a good game for a group of friends? Why?",
      "What is the most important skill to have in billiards?",
      "Describe a time you were surprised by an opponent's skill in billiards.",
      "How do you think playing billiards has helped you in other aspects of your life?",
      "Do you have any pre-game rituals or routines when you play?",
      "What's the most challenging part of aiming and making a shot in billiards?"
    ],
    "test preparation": [
      "How do you typically prepare for a test? Tell me about your study routine, and what methods you find most effective.",
      "What is the hardest part about preparing for a test for you? Do you struggle with a specific subject, or with motivation?",
      "Describe a time when you prepared for a test and were proud of your result. What was the test, and how did you feel when you got your score?",
      "How do you manage your time when you have multiple tests to prepare for?",
      "Tell me about a time you had to study for a test with a group of friends. What was that like?",
      "What's the biggest difference between preparing for a written test and an oral presentation or exam?",
      "Do you prefer to study in a library, a cafe, or at home? Why?",
      "Tell me about a time you tried a new study method that didn't work. What happened?",
      "What kind of resources do you use to study? Do you use books, online videos, or flashcards?",
      "How do you deal with test anxiety or stress?",
      "Describe the feeling of walking into a test you feel well-prepared for.",
      "What's the best piece of advice you've received about test preparation?",
      "How do you feel after you've finished a difficult test?",
      "Tell me about a time you had to pull an all-nighter to prepare for a test.",
      "Do you think it's better to study a little bit every day or to cram at the last minute? Why?",
      "What is the most important part of a good study plan?",
      "Describe a time you were surprised by a test's difficulty, even though you had studied a lot.",
      "How do you motivate yourself to study when you don't feel like it?"
    ],
    "news": [
      "How do you usually get your news? Do you prefer to read, watch, or listen to the news, and why?",
      "Tell me about the most interesting news you've heard recently. What was it about, and why did it catch your attention?",
      "What is your opinion on the news and its importance in our daily lives? Do you think it's important to stay up-to-date, and why?",
      "What's the biggest difference between reading the news online and from a physical newspaper?",
      "Do you trust the news you hear? Why or why not?",
      "Tell me about a time you heard a news story that made you feel emotional.",
      "How do you think social media has changed the way people get their news?",
      "What's one kind of news that you avoid, and why?",
      "Describe a time you talked with your family or friends about a recent news story.",
      "Do you think it's important to read news from different sources and perspectives?",
      "How do you feel when you hear good news about the world?",
      "What's the most surprising news story you've heard in the last year?",
      "How do you think the news will change in the future with new technology?",
      "Tell me about a time you learned something new from the news that had a big impact on you.",
      "Do you think the news media has a responsibility to be objective?",
      "What kind of news do you usually check first in the morning?",
      "Describe a news story that you found to be very confusing or difficult to understand.",
      "What's the most reliable source for news in your opinion?"
    ],
    "shopping": [
      "When was the last time you went shopping? What did you buy, and was it an enjoyable experience?",
      "What is your favorite thing to buy when you go shopping? Describe your shopping style and what you look for when you buy it.",
      "Tell me about your best and worst shopping experiences. What happened in each situation, and what made them so different?",
      "What's the biggest difference between shopping online and shopping in a physical store?",
      "Do you prefer to go shopping alone or with friends or family? Why?",
      "Tell me about a time you bought something impulsively and regretted it later.",
      "How do you usually decide where to go shopping?",
      "What kind of discounts or sales do you look for when you go shopping?",
      "Describe a time you went shopping for a special occasion, like a wedding or a birthday.",
      "What's the most important factor for you when you're shopping? Is it price, quality, or brand?",
      "Tell me about a time you had to return something you bought. What was the process like?",
      "What's one item that you always find yourself buying when you go shopping?",
      "How do you handle your budget when you go on a shopping trip?",
      "Describe the atmosphere of your favorite store. What does it look and feel like?",
      "Have you ever bought something vintage or second-hand? What was it?",
      "How do you feel after a successful shopping trip?",
      "What kind of shopping do you do most often? Grocery shopping, clothes shopping, or something else?",
      "Tell me about a time you found a great deal on something you wanted to buy."
    ],
    "beach": [
      "What do you like most about going to the beach? Is it the swimming, the sun, or just relaxing by the water?",
      "Tell me about the last time you went to the beach. Who did you go with, what did you do, and what was the weather like?",
      "What are some of the things you always bring with you when you go to the beach? Describe your beach essentials and why they are important.",
      "What's the biggest difference between a beach in your country and a beach you've been to in another country?",
      "Describe the atmosphere of your favorite beach. What does it look and sound like?",
      "What kind of activities do you enjoy doing at the beach besides swimming and sunbathing?",
      "Tell me about a time you had a bonfire or a picnic at the beach at night.",
      "Do you prefer a beach with lots of people or a quiet, secluded beach? Why?",
      "What's your favorite thing to eat or drink when you're at the beach?",
      "How do you prepare for a day at the beach?",
      "Tell me about a time you had a bad experience at the beach. What happened?",
      "What's the best time of year to go to the beach in your opinion?",
      "Describe a memorable moment you had while watching the sunset or sunrise at the beach.",
      "How do you feel when you have your feet in the sand and the water on your skin?",
      "What's one thing you wish you could change about your favorite beach?",
      "Tell me about a time you went to the beach to relax and clear your head.",
      "Have you ever tried surfing or a different water sport at the beach? What was it like?",
      "What's the most beautiful beach you've ever been to?"
    ],
    "volunteering": [
      "Tell me about a volunteering experience you've had. What kind of work did you do, and what was the most rewarding part of it?",
      "What is the most rewarding part of volunteering? How does it make you feel, and why do you think it's important?",
      "How did you first get interested in volunteering? Was there a specific person or event that inspired you to start?",
      "What's the biggest difference between volunteering and a paid job?",
      "Describe the people you worked with during your volunteering experience. What were they like?",
      "Tell me about a time you faced a challenge or a difficult situation while volunteering.",
      "What kind of volunteering work would you like to do in the future?",
      "How do you think volunteering has changed your perspective on life?",
      "Do you prefer to volunteer alone or with friends or a group? Why?",
      "What's the most important skill or lesson you've learned from volunteering?",
      "Tell me about a time when you saw the direct impact of your volunteering efforts.",
      "How do you find out about volunteering opportunities in your community?",
      "What's the most common type of volunteering people do in your country?",
      "Describe the feeling of helping others through volunteering.",
      "What's the biggest misconception people have about volunteering?",
      "Tell me about a time you convinced a friend to volunteer with you.",
      "Do you think it's important for everyone to volunteer at some point in their life? Why or why not?",
      "How do you balance your volunteering with your other responsibilities?"
    ],
    "chess": [
      "How often do you play chess? Who do you usually play with, and what do you like most about the game?",
      "Describe a memorable game of chess you've played. What happened, and how did you feel during the game?",
      "What are some of the challenges of playing chess? Do you think it's a game of pure strategy, and why?",
      "How did you first learn to play chess?",
      "Tell me about a time you won a particularly difficult game of chess.",
      "Do you prefer to play against a person or a computer? Why?",
      "What's the biggest difference between chess and other board games?",
      "Describe the moment you realize you're about to lose a game of chess. How do you feel?",
      "What's your favorite chess opening or strategy?",
      "Tell me about a time you taught someone how to play chess.",
      "Do you think chess helps with your cognitive skills in other areas of your life?",
      "What's the most surprising move you've ever seen in a game of chess?",
      "How do you feel when you win a game of chess?",
      "What is the most important skill to have in chess?",
      "Describe the atmosphere of a chess tournament or club.",
      "Do you think chess is a good game for all ages? Why or why not?",
      "Tell me about a time you played chess in an unusual location.",
      "What's the most common mistake you see beginners make when they play chess?"
    ],
    "cafe": [
      "I’d like to know about a cafe you often visit. Where is it and how often do you go there? What does it look like and why do you like this place?",
      "What's your favorite kind of coffee or drink to order at a cafe? Why do you like it?",
      "Tell me about a memorable conversation you had with a friend at a cafe.",
      "How do you choose a new cafe to visit?",
      "Describe the atmosphere of your favorite cafe. What does it sound and feel like?",
      "What kind of food or snacks do you like to eat at a cafe?",
      "Do you prefer to go to a cafe to study or to socialize? Why?",
      "Tell me about a time you went to a cafe with a book and just relaxed.",
      "What's the biggest difference between a chain cafe and a local, independent cafe?",
      "How do you feel when you're in a cafe with a good vibe?",
      "What is the most common reason you visit a cafe?",
      "Describe a time you had a bad experience at a cafe. What happened?",
      "What's your favorite time of day to go to a cafe?",
      "Tell me about a cafe that you would like to open yourself. What would it be like?",
      "How do you think cafes have changed over the last 10 years?",
      "Do you have a favorite spot to sit in your favorite cafe?",
      "What kind of music do you like to listen to in a cafe?",
      "Tell me about a time you went to a cafe to work or study for a long period."
    ],
    "SNS": [
      "Tell me about the last time you used SNS. What website was it? What did you do on this SNS website? Tell me about this experience as much as you can.",
      "What is your favorite SNS? What do you use it for? Why do you like it?",
      "How did SNS change your life? Tell me all the advantages of SNS.",
      "Tell me about how you first became interested in SNS. Who taught you? How did you feel? Tell me in detail.",
      "How do you think social media has changed the way people communicate?",
      "What's the biggest disadvantage of using social media?",
      "Do you prefer to follow friends and family on SNS, or celebrities and public figures? Why?",
      "Tell me about a time you shared something on SNS that got a lot of attention.",
      "What's your typical routine when you check your favorite SNS?",
      "Do you think SNS is a good way to stay in touch with people who live far away? Why or why not?",
      "Tell me about a time you felt pressured to post something on SNS.",
      "What's the biggest difference between using SNS now and when you first started?",
      "How do you feel when you see your friends posting about their travels and fun experiences?",
      "What kind of content do you post most often on your SNS?",
      "Do you think SNS has a positive or negative impact on your mental health?",
      "Tell me about a time you had to disconnect from social media for a while. What happened?",
      "How do you use SNS to discover new music, movies, or books?",
      "What's one thing you wish you could change about your favorite SNS platform?"
    ],
    "movies": [
      "I’d like to know about your favorite and least favorite kinds of movies. What are they? What do you like or dislike about these movies?",
      "What's the last movie you watched and what did you think of it?",
      "Do you prefer watching movies at a cinema or at home? Why?",
      "Tell me about a movie that you think everyone should watch.",
      "What kind of movie genres do you dislike and why?",
      "How has your taste in movies changed over time?",
      "Tell me about a movie that made you feel emotional. What was it about?",
      "Who is your favorite movie director and why?",
      "What's a movie that you have watched multiple times and why do you keep coming back to it?",
      "How do you find new movies to watch?",
      "Describe a time you saw a movie with a friend that they loved but you hated.",
      "What's the biggest difference between watching a movie on a big screen and on a smaller screen?",
      "Do you prefer to watch foreign films or films in your native language? Why?",
      "Tell me about a movie that you think is overrated and why you feel that way.",
      "What kind of snacks do you usually eat when you watch a movie?",
      "How do you decide what movie to watch when you're with a group of friends?",
      "What's one thing you would change about your favorite movie?",
      "Tell me about a time you were surprised by the ending of a movie."
    ],
    "game": [
      "How is the game you played when you were a child different from a game you enjoy now? What are the similarities between the past and present? Please describe the contrast in detail.",
      "What is your favorite game to play these days? Tell me what it is and what you like about it.",
      "Describe a memorable experience you had playing a game with friends.",
      "What's the biggest difference between video games and board games? Do you have a preference?",
      "Tell me about a time you played a game for a very long time, like a marathon session.",
      "How do you feel when you win a game? What about when you lose?",
      "What kind of genre of games do you enjoy most? (e.g., action, strategy, puzzle)",
      "Do you play games on a computer, a console, or on your phone? Why?",
      "Tell me about a time you learned a new skill or a new language from playing a game.",
      "What's the biggest challenge you've faced in a game and how did you overcome it?",
      "How do you think video games have changed over the past 10 years?",
      "Tell me about a game that you played a lot in your childhood that you still remember fondly.",
      "What's the most surprising thing you've ever seen or experienced in a game?",
      "Do you think games are a good way to socialize with friends?",
      "What's the most important quality in a good game?",
      "Describe a game that you found to be very difficult to learn at first.",
      "Tell me about a time you introduced a friend to a game and they loved it.",
      "How do you think games will evolve in the future with new technology?"
    ],
    "concert": [
      "You indicated in the survey that you go to concerts. Which concerts do you go to? Who do you go with?",
      "Tell me about the concert you've been to recently. How many people were there? What did you do?",
      "Tell me about a memorable incident that happened at a concert.",
      "What's the biggest difference between a small, intimate concert and a large stadium concert?",
      "How do you prepare for a concert? What do you wear, and how do you get there?",
      "What's the most exciting part of a live concert?",
      "Describe the feeling of being in a crowd at a concert, listening to your favorite music.",
      "Tell me about a time you saw a concert by an artist you didn't know much about.",
      "Do you prefer to be close to the stage or further back where you can see the whole venue? Why?",
      "What's the best concert you've ever been to, and what made it so great?",
      "How do you buy tickets for concerts?",
      "Tell me about a time you went to a concert alone. What was that experience like?",
      "What kind of music do you like to listen to at a concert?",
      "Have you ever seen a concert by your favorite artist or band? What was it like?",
      "Do you think live concerts are a better experience than watching a recorded performance? Why or why not?",
      "What's the most memorable song you've heard performed live?",
      "Describe the atmosphere of a music festival. What is it like?",
      "Tell me about a time you went to a concert with your family."
    ],
    "health": [
      "You indicated in the survey you work out at the gym. What do you like about the gym? How do you feel after work out?",
      "Tell me about a healthy person you know. How does he or she stay healthy? How did he or she affect you?",
      "Let's talk about the process of going to the hospital. Describe in detail from making a reservation to the end of treatment.",
      "What is your daily routine for staying healthy? Do you eat certain foods or have a fitness routine?",
      "What's the biggest challenge you face when trying to maintain a healthy lifestyle?",
      "How do you deal with stress in your life? What are some of your coping mechanisms?",
      "Tell me about a time you felt sick and had to go to the hospital. What happened?",
      "Do you think it's important to have a good work-life balance for your health? Why?",
      "What kind of food do you eat to stay healthy?",
      "Describe a time you tried a new fitness class or exercise. What was it like?",
      "How do you feel when you are in good physical shape?",
      "What's the best piece of advice you've received about your health?",
      "Tell me about a time you helped a friend or family member with a health problem.",
      "What are some common health problems in your country?",
      "How do you think technology has changed the way we approach health and fitness?",
      "Describe the process of visiting a new doctor for the first time.",
      "Do you think mental health is just as important as physical health? Why?",
      "What's the most common type of workout you do at the gym?"
    ],
    "searching job": [
      "You indicated in the survey that you are looking for a job. What kind of job are you looking for? How are you preparing for it? Tell me in detail.",
      "Tell me about the last time you had a job interview. How did it go, and how did you prepare for it?",
      "What is the hardest part about looking for a job? Do you struggle with writing resumes, networking, or something else?",
      "What's the biggest difference between your dream job and a job you would be willing to take?",
      "Tell me about a time you had to write a cover letter for a job. What did you write?",
      "How do you find job openings? Do you use online job boards or networking?",
      "What's the most important quality you look for in a company?",
      "Describe a time you had to deal with rejection after a job interview.",
      "What kind of skills are you trying to improve to help you in your job search?",
      "Tell me about a time you had a networking event. What was that experience like?",
      "How do you stay motivated when you're looking for a job for a long time?",
      "What's the best piece of advice you've received about looking for a job?",
      "How do you feel after you've submitted a job application?",
      "Tell me about a time you had to move to a new city for a job.",
      "Do you think it's important to have a strong online presence for your job search? Why or why not?",
      "What is the biggest challenge of preparing for a job interview?",
      "Describe a time you were excited about a job opportunity.",
      "How do you think the job market has changed in the last 10 years?"
    ],
    "reading books to children": [
      "Tell me about a time you read a book to a child. What book was it, and what was the child's reaction?",
      "What do you think is the most important part of reading to children? Is it the story, the characters, or the interaction?",
      "How do you choose which books to read to a child? What factors do you consider, and what kind of stories do you think are best for them?",
      "What's the biggest difference between reading a book to a child and reading a book for yourself?",
      "Describe a time a child asked you a difficult question about a story you were reading. How did you answer?",
      "Tell me about your favorite children's book. What is it, and what do you like about it?",
      "How do you make reading a book to a child more interactive and fun?",
      "What kind of emotions do you see in children when you read a story to them?",
      "Do you think reading to children has a big impact on their development? Why?",
      "Tell me about a time you had to read a book to a child that you found to be very boring.",
      "What's the best time of day to read a book to a child?",
      "Describe a time you had to read the same book to a child over and over again.",
      "How do you feel when you see a child's imagination come to life through a story?",
      "What's the most important lesson you think children can learn from books?",
      "Tell me about a time a child finished a book and wanted to read more.",
      "Do you have a favorite voice or tone you use when reading a book to a child?",
      "What's one thing you would change about a classic children's book?",
      "How do you feel when you're reading a book with a child in your lap?"
    ],
    "music": [
      "What's your favorite music genre and why do you like it? Tell me about a song that you think perfectly represents that genre.",
      "Who is your favorite artist or band? Tell me about their music, and why you feel a connection to them.",
      "Tell me about the last time you listened to a song that made you feel emotional. What was the song, and what emotion did it bring out in you?",
      "How do you typically discover new music?",
      "Do you prefer listening to music on a streaming service or on physical media, like a CD or a record? Why?",
      "Tell me about a time you went to a live music event that wasn't a formal concert.",
      "What's the biggest difference between music from your childhood and music today?",
      "Describe the most memorable lyric you've heard in a song. What was it, and why did it stick with you?",
      "How do you feel when you listen to music? Does it make you happy, relaxed, or something else?",
      "What's a song that always makes you want to dance?",
      "Tell me about a time you shared a song with a friend and they loved it.",
      "Do you think music can change a person's mood? Why or why not?",
      "What's the most common genre of music you listen to with your family or friends?",
      "Tell me about a song that you think is overrated and why you feel that way.",
      "How do you organize your music collection?",
      "What's the most important quality in a good song?",
      "Describe a time you were surprised by the music of an artist or band you didn't know well.",
      "Do you think it's important for music to have a strong message?"
    ],
    "musical instruments": [
      "Do you play any musical instruments? If so, which one, and how long have you been playing it?",
      "How did you get interested in playing a musical instrument? Was there a specific person or event that inspired you to start?",
      "Tell me about a memorable experience you had playing an instrument. Where were you, and who were you playing for?",
      "What's the biggest difference between playing music alone and playing with a group or band?",
      "How do you practice your instrument? Do you have a routine?",
      "Tell me about a time you learned a particularly difficult song or piece of music.",
      "What's the biggest challenge you face when playing your instrument?",
      "Describe the feeling of playing your instrument and getting into a flow state.",
      "What kind of music do you like to play on your instrument?",
      "Tell me about a time you performed in front of an audience. What was that like?",
      "Do you think playing a musical instrument has a positive impact on your life? Why?",
      "What's the best piece of advice you've received about playing your instrument?",
      "How do you feel when you make a mistake while playing your instrument?",
      "Tell me about a time you bought a new instrument. What was it, and why did you get it?",
      "Do you think it's ever too late to learn how to play a musical instrument? Why or why not?",
      "What is the most important skill to have when playing an instrument?",
      "Describe a time you helped a friend or family member learn how to play an instrument.",
      "How do you feel when you listen to music played by someone with great skill?"
    ],
    "dancing": [
      "What kind of dancing do you like to do or watch? How often do you dance, and what's your favorite part about it?",
      "When was the last time you danced? What was the occasion, and who were you with?",
      "Describe a memorable dancing experience you've had. What made it so special and how did it make you feel?",
      "What's the biggest difference between social dancing and professional dancing?",
      "How did you first get interested in dancing?",
      "Tell me about a time you went to a dance class or workshop. What was it like?",
      "What's the biggest challenge you face when you're dancing?",
      "Describe the feeling of dancing to a song you love.",
      "What kind of music do you like to dance to most?",
      "Tell me about a time you had to learn a specific dance for a special event, like a wedding.",
      "Do you think dancing is a good way to express yourself? Why or why not?",
      "What's the best dance move you know?",
      "How do you feel after you've been dancing for a long time?",
      "Tell me about a time you danced with a friend or a partner that you felt a great connection with.",
      "Do you prefer to dance in a crowd or in a more private setting? Why?",
      "What's the most common type of dance you see at parties or clubs?",
      "Describe a time you were surprised by someone's dancing ability.",
      "How do you think dancing has changed over the years?"
    ],
    "writing": [
      "Do you enjoy writing? What kind of things do you like to write, and what do you find most interesting about the process?",
      "When was the last time you wrote something? What was it, and who was it for?",
      "What is the most challenging part of writing for you? Is it coming up with ideas, organizing your thoughts, or something else?",
      "What's the biggest difference between writing for yourself and writing for others?",
      "How do you feel when you have writer's block?",
      "Tell me about a time you wrote something that you were particularly proud of.",
      "What kind of writing do you do most often? Is it for work, school, or personal hobbies?",
      "Describe a time you had to write a letter or an email for a very important occasion.",
      "What's the best advice you've received about writing?",
      "Tell me about a time you collaborated with someone else on a writing project.",
      "How do you organize your thoughts and ideas before you start writing?",
      "What is your favorite tool to use for writing, like a pen and paper or a computer?",
      "Describe the feeling of finishing a long writing project.",
      "Do you think writing is an important skill to have in daily life? Why or why not?",
      "What's the most creative piece of writing you've ever done?",
      "Tell me about a time a friend or family member read something you wrote.",
      "How do you feel when you read something you wrote a long time ago?",
      "What's the biggest difference between writing a short story and a long essay?"
    ],
    "drawing": [
      "Do you enjoy drawing? What kind of things do you like to draw, and what tools or materials do you use?",
      "Tell me about the last time you drew something. What was it, and what was your inspiration for it?",
      "What do you like about drawing? Does it help you relax, express yourself, or something else?",
      "What's the biggest difference between drawing from a photo and drawing from real life?",
      "How did you first get interested in drawing?",
      "Tell me about a time you drew a portrait of a friend or family member. What was their reaction?",
      "What's the biggest challenge you face when you're drawing?",
      "Describe the feeling of getting lost in a drawing and losing track of time.",
      "What kind of things do you like to draw most? (e.g., people, landscapes, cartoons)",
      "Tell me about a time you created a piece of art that you were particularly proud of.",
      "Do you think drawing is a good way to express your feelings and emotions? Why or why not?",
      "What's the best piece of advice you've received about drawing?",
      "How do you feel when you make a mistake on a drawing?",
      "Tell me about a time you took a drawing class or workshop. What was it like?",
      "Do you think anyone can learn how to draw, or is it a natural talent?",
      "What is the most important skill to have in drawing?",
      "Describe a time you helped a friend or family member with a drawing project.",
      "How do you feel when you see a finished drawing that you created?"
    ],
    "cooking": [
      "What is your favorite dish to cook? Tell me about the recipe, and why you enjoy making it so much.",
      "Tell me about a time you cooked something for someone special. Who was it, and what did you make for them?",
      "What is the most challenging part of cooking for you? Do you find it difficult to follow recipes, or to be creative?",
      "What's the biggest difference between cooking for yourself and cooking for a large group of people?",
      "How do you feel when you're in the kitchen cooking?",
      "Tell me about a time you tried a new recipe and it turned out to be a disaster. What happened?",
      "What kind of food do you like to cook most? (e.g., Italian, Korean, Mexican)",
      "Describe a time you had to cook a meal with a friend or a partner.",
      "What's the best piece of advice you've received about cooking?",
      "Tell me about a time you had to substitute an ingredient because you didn't have it.",
      "Do you think cooking is an important skill to have in daily life? Why or why not?",
      "What's the most creative dish you've ever made?",
      "How do you feel when you see someone enjoying the food you cooked?",
      "Tell me about a time you made a meal to celebrate a special occasion.",
      "Do you prefer to follow a recipe strictly or to experiment and be creative? Why?",
      "What is the most common mistake you see people make when they cook?",
      "Describe a time you had to cook a meal with a very limited amount of ingredients.",
      "How do you think cooking has changed the way you think about food?"
    ],
    "reading": [
      "What are you currently reading? Tell me about the book, and what do you like about it so far?",
      "What is your favorite genre of books? Why do you like it, and can you recommend a book in that genre?",
      "Tell me about a book that changed the way you think about something. What was the book, and how did it affect you?",
      "What's the biggest difference between reading a physical book and reading on a device, like an e-reader?",
      "How do you find new books to read?",
      "Tell me about a time you read a book that you couldn't put down. What was it about?",
      "What's the biggest challenge you face when you're trying to read more?",
      "Describe the atmosphere of your favorite place to read. What does it look and feel like?",
      "Do you prefer fiction or non-fiction books? Why?",
      "Tell me about a time you read a book that you didn't like but finished anyway.",
      "How do you feel after you've finished a really good book?",
      "What's the best piece of advice you've received about reading?",
      "How has reading changed the way you see the world?",
      "Tell me about a time you recommended a book to a friend and they loved it.",
      "Do you think reading is an important part of a person's life? Why or why not?",
      "What is the most common genre of books you see people reading?",
      "Describe a time you were surprised by the ending of a book.",
      "What's the biggest difference between reading a book and watching a movie based on that book?"
    ],
    "investing": [
      "Do you invest? If so, what do you invest in, and how do you feel about the risks involved?",
      "How did you get interested in investing? Was there a specific event or person that inspired you to start?",
      "Tell me about a time you made a successful investment. What was it, and how did you feel when it paid off?",
      "What's the biggest difference between short-term and long-term investing?",
      "How do you feel when the market is volatile or when your investments go down?",
      "Tell me about a time you made a bad investment. What happened, and what did you learn?",
      "What kind of research do you do before you make an investment?",
      "Describe the most important lesson you've learned from investing.",
      "Do you prefer to invest in individual stocks, mutual funds, or something else? Why?",
      "Tell me about a time you talked with a friend or family member about investing.",
      "How do you think investing has changed your financial life?",
      "What's the best piece of advice you've received about investing?",
      "How do you feel when you see your investments grow over time?",
      "Tell me about a time you had to make a quick decision about an investment.",
      "Do you think it's important for everyone to start investing early? Why or why not?",
      "What is the most common mistake you see beginners make when they start investing?"
    ],
    "travel magazine": [
      "Do you read travel magazines? Which one is your favorite, and what kind of articles or photos do you enjoy most?",
      "What is the most interesting place you've read about in a travel magazine? What about it made you want to visit?",
      "How do travel magazines influence your travel plans? Do they inspire you to go to new places, or help you plan your trips?",
      "What's the biggest difference between a travel magazine and an online travel blog?",
      "Describe a time you saw a photo in a travel magazine that was so beautiful it took your breath away.",
      "Tell me about a time you used a travel magazine to plan a trip. What did you do?",
      "What kind of articles do you like to read most in a travel magazine? Is it about culture, food, or adventure?",
      "How do you feel when you read a travel magazine? Does it make you want to travel?",
      "What's one place you've read about in a travel magazine that you would never want to visit? Why?",
      "Tell me about a time you shared a travel magazine with a friend or family member.",
      "Do you think travel magazines are a good source of information for travelers? Why or why not?",
      "What's the most common destination you see featured in travel magazines?",
      "Describe a time you read a travel magazine and it completely changed your perspective on a place.",
      "How do you think travel magazines have changed over the years?",
      "What's the best piece of advice you've read in a travel magazine?",
      "Tell me about a time you read a travel magazine and discovered a hidden gem that you later visited.",
      "Do you prefer a travel magazine that focuses on luxury travel or budget travel?",
      "How do you feel when you see a place you've been to featured in a travel magazine?"
    ],
    "singing": [
      "Do you enjoy singing? What's your favorite song to sing, and why do you like it so much?",
      "When was the last time you sang? Where were you, who were you with, and what was the occasion?",
      "Tell me about a memorable experience you had while singing. What happened, and what made it so special?",
      "What's the biggest difference between singing alone and singing with a group, like in a choir?",
      "How do you feel when you sing? Does it make you happy or help you release stress?",
      "Tell me about a time you sang karaoke. What was the experience like?",
      "What's the most difficult song for you to sing?",
      "Describe the feeling of singing along to a song with a large crowd at a concert.",
      "What kind of music do you like to sing most?",
      "Tell me about a time you had to sing a song in front of a group of people. What was that like?",
      "Do you think singing is a good way to express your feelings? Why or why not?",
      "What's the best piece of advice you've received about singing?",
      "How do you feel when you hit a difficult note in a song perfectly?",
      "Tell me about a time you were surprised by someone's singing ability.",
      "How do you feel when you listen to your favorite singer's voice?"
    ],
    "basketball": [
      "Do you play basketball? How often do you play, and what do you like most about the game?",
      "Who is your favorite basketball player and why do you like them? Describe their playing style and what makes them so great.",
      "Tell me about a memorable basketball game you've watched or played in. What happened, and how did you feel during the game?",
      "What's the biggest difference between playing basketball for fun and playing in a competitive league?",
      "How do you feel when you make a great shot or a great play?",
      "Tell me about a time you played basketball with your friends. What was that experience like?",
      "What's the most difficult part of playing basketball for you?",
      "Describe the atmosphere of a live basketball game at a stadium.",
      "Do you prefer to play offense or defense in basketball? Why?",
      "Tell me about a time you had to work with your teammates to win a game.",
      "How do you think playing basketball has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing basketball?",
      "How do you feel when your favorite team wins the championship?",
      "Tell me about a time you saw a spectacular play in a basketball game.",
      "Do you think basketball is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in basketball?",
      "Describe a time you were surprised by the outcome of a basketball game."
    ],
    "baseball/softball": [
      "Do you play baseball or softball? How often do you play, and what do you like most about the game?",
      "Who is your favorite baseball team? Tell me about a memorable game you've watched or played in.",
      "What is the most challenging part of playing baseball or softball? Do you find it difficult to hit the ball, or to field it?",
      "What's the biggest difference between playing baseball and watching it on TV?",
      "How do you feel when you hit a home run or make a great catch?",
      "Tell me about a time you played baseball with your friends. What was that experience like?",
      "What's the most difficult position to play in baseball or softball, in your opinion?",
      "Describe the atmosphere of a live baseball game at a stadium.",
      "Do you prefer to be at bat or in the outfield? Why?",
      "Tell me about a time you had to work with your teammates to win a game.",
      "How do you think playing baseball has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing baseball?",
      "How do you feel when your favorite team wins the World Series?",
      "Tell me about a time you saw a spectacular play in a baseball game.",
      "Do you think baseball is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in baseball?",
      "Describe a time you were surprised by the outcome of a baseball game.",
      "What's the biggest difference between baseball and softball?"
    ],
    "soccer": [
      "Do you play soccer? How often do you play, and what do you like most about the game?",
      "Who is your favorite soccer player and why do you like them? Describe their skills and what makes them a great player.",
      "Tell me about a memorable soccer game you've watched or played in. What was the final score, and how did you feel during the game?",
      "What's the biggest difference between playing soccer for fun and playing in a competitive league?",
      "How do you feel when you score a goal or make a great save?",
      "Tell me about a time you played soccer with your friends. What was that experience like?",
      "What's the most difficult position to play in soccer, in your opinion?",
      "Describe the atmosphere of a live soccer game at a stadium.",
      "Do you prefer to play offense or defense in soccer? Why?",
      "Tell me about a time you had to work with your teammates to win a game.",
      "How do you think playing soccer has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing soccer?",
      "How do you feel when your favorite team wins the World Cup?",
      "Tell me about a time you saw a spectacular play in a soccer game.",
      "Do you think soccer is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in soccer?",
      "Describe a time you were surprised by the outcome of a soccer game.",
      "What's the biggest difference between a friendly match and a tournament match?"
    ],
    "american football": [
      "Do you watch American football? Who is your favorite team, and what do you like about the sport?",
      "How did you get interested in American football? Was it a friend, a family member, or something else that got you into it?",
      "Tell me about a memorable American football game you've watched. What happened in the game, and who was playing?",
      "What's the biggest difference between American football and other sports you've watched?",
      "How do you feel during a close American football game? Does it make you feel nervous or excited?",
      "Tell me about a time you watched a game with a large group of people. What was the atmosphere like?",
      "What's the most difficult part of understanding American football for a beginner?",
      "Describe the atmosphere of a live American football game at a stadium.",
      "Do you have a favorite position in American football? Why?",
      "Tell me about a time you were surprised by the outcome of an American football game.",
      "How do you think American football has changed over the years?",
      "What's the best piece of advice you've received about watching American football?",
      "How do you feel when your favorite team wins the Super Bowl?",
      "Tell me about a time you saw a spectacular play in a game, like a game-winning touchdown.",
      "Do you think American football is a good sport to introduce to someone who has never watched it? Why or why not?",
      "What is the most important skill to have in American football, in your opinion?",
      "Describe a time you watched a game with your family or friends. What was that like?",
      "What's the biggest difference between college football and professional football?"
    ],
    "hockey": [
      "Do you play or watch hockey? Who is your favorite team or player, and what do you like about the sport?",
      "What do you like most about hockey? Do you enjoy the fast pace, the skill, or the physicality of the game?",
      "Tell me about a memorable hockey game you've watched or played in. What was the atmosphere like, and what was the final score?",
      "What's the biggest difference between playing hockey and watching it on TV?",
      "How do you feel when your favorite team scores a goal?",
      "Tell me about a time you watched a game with a large group of people. What was that like?",
      "What's the most difficult part of playing hockey for you?",
      "Describe the atmosphere of a live hockey game at an arena.",
      "Do you prefer to play offense or defense in hockey? Why?",
      "Tell me about a time you were surprised by the outcome of a hockey game.",
      "How do you think playing hockey has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing hockey?",
      "How do you feel when your favorite team wins the Stanley Cup?",
      "Tell me about a time you saw a spectacular play in a hockey game, like a game-winning shot.",
      "Do you think hockey is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in hockey?",
      "Describe a time you played hockey on a frozen lake or pond.",
      "What's the biggest difference between playing hockey on ice and playing street hockey?"
    ],
    "cricket": [
      "Do you play or watch cricket? Who is your favorite team or player, and what do you like about the sport?",
      "What do you like most about cricket? Is it the strategy, the teamwork, or something else?",
      "Tell me about a memorable cricket game you've watched or played in. What happened, and how did you feel during the game?",
      "What's the biggest difference between playing cricket and watching it on TV?",
      "How do you feel when your favorite team hits a six or takes a wicket?",
      "Tell me about a time you watched a game with a large group of people. What was that experience like?",
      "What's the most difficult part of playing cricket for you?",
      "Describe the atmosphere of a live cricket match at a stadium.",
      "Do you prefer to bat or bowl? Why?",
      "Tell me about a time you were surprised by the outcome of a cricket match.",
      "How do you think playing cricket has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing cricket?",
      "How do you feel when your favorite team wins a major tournament?",
      "Tell me about a time you saw a spectacular play in a cricket match.",
      "Do you think cricket is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in cricket?",
      "Describe a time you played cricket in a casual setting with friends.",
      "What's the biggest difference between a Test match and a T20 match?"
    ],
    "golf": [
      "How often do you play golf? Who do you usually play with, and what do you like most about the game?",
      "What do you like about playing golf? Is it the challenge of the game, or just being outdoors?",
      "Tell me about a memorable golf game you've played. What was the course like, and what was your score?",
      "What's the biggest difference between a professional golf tournament and a casual game with friends?",
      "How do you feel when you make a great shot or a long putt?",
      "Tell me about a time you played golf with a friend or family member. What was that experience like?",
      "What's the most difficult part of playing golf for you?",
      "Describe the atmosphere of a golf course on a beautiful day.",
      "Do you prefer to play on a flat course or a hilly one? Why?",
      "Tell me about a time you were surprised by the outcome of a golf game.",
      "How do you think playing golf has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing golf?",
      "How do you feel when you get a hole-in-one or a birdie?",
      "Tell me about a time you had to deal with a bad shot or a bad hole.",
      "Do you think golf is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in golf?",
      "Describe a time you played golf with a group of friends for a competition.",
      "What's the biggest difference between a driving range and a real golf course?"
    ],
    "volleyball": [
      "How often do you play volleyball? Who do you usually play with, and what do you like most about the game?",
      "What do you like most about playing volleyball? Is it the teamwork, the exercise, or something else?",
      "Tell me about a memorable volleyball game you've played. What happened, and what was the final score?",
      "What's the biggest difference between playing volleyball indoors and on the beach?",
      "How do you feel when you make a great serve or a great save?",
      "Tell me about a time you played volleyball with your friends. What was that experience like?",
      "What's the most difficult part of playing volleyball for you?",
      "Describe the atmosphere of a competitive volleyball game.",
      "Do you prefer to play in the front row or the back row? Why?",
      "Tell me about a time you had to work with your teammates to win a game.",
      "How do you think playing volleyball has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing volleyball?",
      "How do you feel when your team wins a tournament?",
      "Tell me about a time you saw a spectacular play in a volleyball game.",
      "Do you think volleyball is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in volleyball?",
      "Describe a time you were surprised by the outcome of a volleyball game.",
      "What's the biggest difference between a casual game and a formal game?"
    ],
    "tennis": [
      "How often do you play tennis? Who do you usually play with, and what do you like most about the game?",
      "What do you like most about playing tennis? Do you enjoy the one-on-one competition, or the exercise?",
      "Tell me about a memorable tennis game you've played. What was the score, and how did you feel after the game?",
      "What's the biggest difference between playing singles and playing doubles in tennis?",
      "How do you feel when you hit a great shot or win a long rally?",
      "Tell me about a time you played tennis with a friend or a family member. What was that experience like?",
      "What's the most difficult part of playing tennis for you?",
      "Describe the atmosphere of a tennis court on a beautiful day.",
      "Do you prefer to play on a hard court or a clay court? Why?",
      "Tell me about a time you were surprised by the outcome of a tennis match.",
      "How do you think playing tennis has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing tennis?",
      "How do you feel when your favorite player wins a major tournament?",
      "Tell me about a time you saw a spectacular play in a tennis match.",
      "Do you think tennis is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in tennis?",
      "Describe a time you played tennis with a friend for a competition.",
      "What's the biggest difference between a professional match and a casual game?"
    ],
    "badminton": [
      "How often do you play badminton? Who do you usually play with, and what do you like most about the game?",
      "What do you like most about playing badminton? Is it the fast pace, or the strategy involved?",
      "Tell me about a memorable badminton game you've played. What happened, and who did you play against?",
      "What's the biggest difference between playing singles and playing doubles in badminton?",
      "How do you feel when you hit a great shot or win a long rally?",
      "Tell me about a time you played badminton with a friend or a family member. What was that experience like?",
      "What's the most difficult part of playing badminton for you?",
      "Describe the atmosphere of a badminton court on a beautiful day.",
      "Do you prefer to play indoors or outdoors? Why?",
      "Tell me about a time you were surprised by the outcome of a badminton match.",
      "How do you think playing badminton has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing badminton?",
      "How do you feel when your favorite player wins a major tournament?",
      "Tell me about a time you saw a spectacular play in a badminton match.",
      "Do you think badminton is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in badminton?",
      "Describe a time you played badminton with a friend for a competition.",
      "What's the biggest difference between a professional match and a casual game?"
    ],
    "table tennis": [
      "How often do you play table tennis? Who do you usually play with, and what do you like most about the game?",
      "What do you like most about playing table tennis? Do you enjoy the quick reflexes it requires, or the challenge of the game?",
      "Tell me about a memorable table tennis game you've played. What was the score, and how did you feel after the game?",
      "What's the biggest difference between playing singles and playing doubles in table tennis?",
      "How do you feel when you hit a great shot or win a long rally?",
      "Tell me about a time you played table tennis with a friend or a family member. What was that experience like?",
      "What's the most difficult part of playing table tennis for you?",
      "Describe the atmosphere of a table tennis hall.",
      "Do you prefer to play offensively or defensively? Why?",
      "Tell me about a time you were surprised by the outcome of a table tennis match.",
      "How do you think playing table tennis has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about playing table tennis?",
      "How do you feel when your favorite player wins a major tournament?",
      "Tell me about a time you saw a spectacular play in a table tennis match.",
      "Do you think table tennis is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in table tennis?",
      "Describe a time you played table tennis with a friend for a competition.",
      "What's the biggest difference between a professional match and a casual game?"
    ],
    "swimming": [
      "How often do you go swimming? Where do you usually go, and what do you like most about it?",
      "What do you like most about swimming? Do you swim for exercise, or for fun and relaxation?",
      "Tell me about a memorable swimming experience you've had. What was it, and how did it make you feel?",
      "What's the biggest difference between swimming in a pool and swimming in a lake or the ocean?",
      "How do you feel when you're in the water?",
      "Tell me about a time you went swimming with your friends or family. What was that experience like?",
      "What's the most difficult part of swimming for you?",
      "Describe the atmosphere of a public pool on a hot day.",
      "Do you prefer to swim laps for exercise or to just float and relax? Why?",
      "Tell me about a time you had to deal with a problem while swimming, like a cramp or a strong current.",
      "How do you think swimming has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about swimming?",
      "How do you feel after you've finished a long swim?",
      "Tell me about a time you went swimming in a beautiful, exotic location.",
      "Do you think swimming is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in swimming?",
      "Describe a time you taught someone how to swim.",
      "What's the biggest difference between swimming and other forms of exercise?"
    ],
    "bicycling": [
      "How often do you go bicycling? Where do you usually go, and what do you like most about it?",
      "What do you like most about bicycling? Do you do it for exercise, to explore new places, or for another reason?",
      "Tell me about a memorable bicycling experience you've had. What happened, and who did you go with?",
      "What's the biggest difference between riding a bicycle for fun and riding one for a commute?",
      "How do you feel when you're riding your bicycle on a nice day?",
      "Tell me about a time you went bicycling with your friends or family. What was that experience like?",
      "What's the most difficult part of bicycling for you?",
      "Describe the atmosphere of a popular bicycling trail or path.",
      "Do you prefer to ride on flat roads or on hilly terrain? Why?",
      "Tell me about a time you had a problem with your bicycle, like a flat tire.",
      "How do you think bicycling has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about bicycling?",
      "How do you feel after you've finished a long bicycle ride?",
      "Tell me about a time you went on a long-distance bicycle trip.",
      "Do you think bicycling is a good way to stay healthy? Why or why not?",
      "What is the most important skill to have when bicycling?",
      "Describe a time you were surprised by a bicycling trick or stunt.",
      "What's the biggest difference between a mountain bike and a road bike?"
    ],
    "skiing/snowboarding": [
      "Do you go skiing or snowboarding? How often do you go, and who do you usually go with?",
      "What do you like most about skiing or snowboarding? Do you enjoy the speed, the challenge, or the scenery?",
      "Tell me about a memorable skiing or snowboarding experience you've had. What was the weather like, and what was the resort like?",
      "What's the biggest difference between skiing and snowboarding?",
      "How do you feel when you're going down a steep slope?",
      "Tell me about a time you went skiing or snowboarding with your friends or family. What was that experience like?",
      "What's the most difficult part of skiing or snowboarding for you?",
      "Describe the atmosphere of a ski resort lodge after a day on the slopes.",
      "Do you prefer to ski or snowboard on fresh powder or on groomed runs? Why?",
      "Tell me about a time you had to deal with a fall or an injury while skiing or snowboarding.",
      "How do you think skiing or snowboarding has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about skiing or snowboarding?",
      "How do you feel after a day of skiing or snowboarding?",
      "Tell me about a time you tried a new, difficult trail for the first time.",
      "Do you think skiing or snowboarding is a good sport for all ages? Why or why not?",
      "What is the most important skill to have in skiing or snowboarding?",
      "Describe a time you were surprised by a difficult part of the trail.",
      "What's the biggest difference between skiing or snowboarding in the morning and in the afternoon?"
    ],
    "ice skating": [
      "How often do you go ice skating? Who do you usually go with, and what do you like most about it?",
      "What do you like most about ice skating? Is it the feeling of gliding on the ice, or something else?",
      "Tell me about a memorable ice skating experience you've had. What happened, and how did it make you feel?",
      "What's the biggest difference between skating on an indoor rink and on an outdoor pond?",
      "How do you feel when you're gliding smoothly on the ice?",
      "Tell me about a time you went ice skating with your friends or family. What was that experience like?",
      "What's the most difficult part of ice skating for you?",
      "Describe the atmosphere of an ice rink during the holiday season.",
      "Do you prefer to skate fast for exercise or to just go at a leisurely pace? Why?",
      "Tell me about a time you fell while ice skating. What happened, and did you get hurt?",
      "How do you think ice skating has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about ice skating?",
      "How do you feel after you've finished a long ice skating session?"
    ],
    "jogging": [
      "How often do you go jogging? Where do you usually go, and what do you like most about it?",
      "What do you like most about jogging? Do you jog for your physical health, or your mental well-being?",
      "Tell me about a memorable jogging experience you've had. What was the weather like, and what did you see during your run?",
      "What's the biggest difference between jogging on a treadmill and jogging outdoors?",
      "How do you feel during and after a jog?",
      "Tell me about a time you went jogging with a friend. What was that experience like?",
      "What's the most difficult part of jogging for you? Is it the beginning, the end, or the motivation?",
      "Describe the atmosphere of your favorite jogging route. What does it look and sound like?",
      "Do you prefer to jog in the morning, afternoon, or evening? Why?",
      "Tell me about a time you had to deal with an injury or pain while jogging.",
      "How do you think jogging has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about jogging?",
      "How do you feel when you've reached a new personal best in your jogging time or distance?",
      "Tell me about a time you participated in a running race or a marathon.",
      "Do you think jogging is a good way to stay healthy? Why or why not?",
      "What is the most important thing you wear or use when you go jogging?",
      "Describe a time you jogged in an unusual or beautiful place.",
      "What's the biggest difference between jogging and walking?"
    ],
    "walking": [
      "How often do you go for a walk? Where do you usually go, and what do you like most about it?",
      "What do you like most about walking? Do you walk for exercise, to clear your head, or for another reason?",
      "Tell me about a memorable walking experience you've had. What happened, and who were you with?",
      "What's the biggest difference between walking in a city and walking in nature?",
      "How do you feel during and after a walk?",
      "Tell me about a time you went for a walk with a friend or a family member. What was that experience like?",
      "What's the most difficult part of walking for you?",
      "Describe the atmosphere of your favorite walking path. What does it look and sound like?",
      "Do you prefer to walk in the morning, afternoon, or evening? Why?",
      "Tell me about a time you had to deal with bad weather while on a walk.",
      "How do you think walking has helped you in other aspects of your life?",
      "Do you think walking is a good way to stay healthy? Why or why not?"
    ],
    "yoga": [
      "How often do you do yoga? Where do you usually do it, and what do you like most about it?",
      "What do you like most about yoga? Do you find it helps with your physical flexibility, or your mental focus?",
      "Tell me about a memorable yoga experience you've had. What happened, and how did you feel after the session?",
      "What's the biggest difference between doing yoga at home and in a class with an instructor?",
      "How do you feel during and after a yoga session?",
      "Tell me about a time you did a particularly difficult yoga pose for the first time.",
      "What's the most difficult part of yoga for you? Is it a physical pose, or the mental aspect?",
      "Describe the atmosphere of your favorite yoga studio. What does it look and feel like?",
      "Tell me about a time you had to deal with an injury or pain while doing yoga.",
      "How do you think yoga has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about yoga?",
      "How do you feel when you've reached a new level of flexibility in a pose?",
      "Tell me about a time you did yoga in a beautiful, natural setting, like a park or on the beach.",
      "Do you think yoga is a good way to stay healthy? Why or why not?",
      "What's the biggest difference between yoga and other forms of exercise?"
    ],
    "hiking/trekking": [
      "How often do you go hiking or trekking? Where do you usually go, and what do you like most about it?",
      "What do you like most about hiking or trekking? Is it the challenge, the views, or just being in nature?",
      "Tell me about a memorable hiking or trekking experience you've had. What was the trail like, and what did you see along the way?",
      "What's the biggest difference between a short day hike and a long, multi-day trekking trip?",
      "How do you feel during and after a hike?",
      "Tell me about a time you went hiking with your friends or family. What was that experience like?",
      "What's the most difficult part of hiking or trekking for you?",
      "Describe the atmosphere of a mountain trail in the morning.",
      "Do you prefer a challenging hike with a big payoff, or a more leisurely hike? Why?",
      "Tell me about a time you had to deal with an injury or a difficult situation while hiking.",
      "How do you think hiking has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about hiking?",
      "How do you feel when you've reached the top of a mountain?",
      "Tell me about a time you went hiking in a place with a very unique landscape.",
      "Do you think hiking is a good way to stay healthy? Why or why not?",
      "What is the most important thing you bring with you when you go hiking?",
      "Describe a time you saw a breathtaking view while on a hike.",
      "What's the biggest difference between hiking in the summer and hiking in the winter?"
    ],
    "fishing": [
      "How often do you go fishing? Where do you usually go, and what do you like most about it?",
      "What do you like most about fishing? Do you enjoy the peacefulness, or the thrill of catching a fish?",
      "Tell me about a memorable fishing experience you've had. What did you catch, and who were you with?",
      "What's the biggest difference between fishing in a lake and fishing in the ocean?",
      "How do you feel when you're waiting for a fish to bite?",
      "Tell me about a time you went fishing with your friends or family. What was that experience like?",
      "What's the most difficult part of fishing for you?",
      "Describe the atmosphere of a fishing spot on a calm, sunny day.",
      "Do you prefer to fish with a rod and reel or with other methods? Why?",
      "Tell me about a time you had to deal with a broken line or a lost fish.",
      "How do you think fishing has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about fishing?",
      "How do you feel when you've caught a really big fish?",
      "Tell me about a time you went fishing in a beautiful, remote location.",
      "Do you think fishing is a good way to relax and de-stress? Why or why not?",
      "What is the most important piece of equipment you bring with you when you go fishing?",
      "Describe a time you went fishing and didn't catch anything. How did you feel?",
      "What's the biggest difference between freshwater and saltwater fishing?"
    ],
    "taekwondo": [
      "How often do you practice Taekwondo? What do you like most about it, and what belt or level are you?",
      "How did you get interested in Taekwondo? Was it a friend, a family member, or something you saw on TV?",
      "Tell me about a memorable Taekwondo experience you've had. What happened, and how did it make you feel?",
      "What's the biggest difference between Taekwondo and other martial arts, like Karate?",
      "How do you feel during and after a Taekwondo practice session?",
      "Tell me about a time you had to break a board or a brick with your hands or feet.",
      "What's the most difficult part of Taekwondo for you? Is it the physical kicks, or the mental discipline?",
      "Describe the atmosphere of a Taekwondo class or a tournament.",
      "Do you prefer practicing forms (poomsae) or sparring? Why?",
      "Tell me about a time you had to use your Taekwondo skills to defend yourself or someone else.",
      "How do you think Taekwondo has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about Taekwondo?",
      "How do you feel when you've advanced to a new belt or level?",
      "Tell me about a time you performed a Taekwondo demonstration in front of an audience.",
      "Do you think Taekwondo is a good way to stay healthy and disciplined? Why or why not?",
      "What is the most important quality in a good Taekwondo master?",
      "Describe a time you were surprised by someone's skill in Taekwondo."
    ],
    "taking fitness classes": [
      "What kind of fitness classes do you take? How often do you take them, and what do you like about the classes?",
      "What do you like most about taking fitness classes? Is it the instructor, the social aspect, or the workout itself?",
      "Tell me about a memorable experience you had in a fitness class. What happened, and what was the class like?",
      "What's the biggest difference between working out alone and taking a fitness class?",
      "How do you feel during and after a fitness class?",
      "Tell me about a time you took a fitness class with a friend. What was that experience like?",
      "What's the most difficult part of taking a fitness class for you?",
      "Describe the atmosphere of your favorite fitness class. What does it look and sound like?",
      "Tell me about a time you had to deal with an injury or pain during a fitness class.",
      "How do you think taking fitness classes has helped you in other aspects of your life?",
      "What's the best piece of advice you've received about fitness classes?",
      "Tell me about a time you took a fitness class for the first time that you were nervous about.",
      "Do you think taking fitness classes is a good way to stay healthy? Why or why not?",
      "What is the most important quality in a good fitness instructor?"
    ],
    "do not exercise": [
      "Tell me about why you don't exercise. Is it because of a lack of time, motivation, or something else?",
      "How do you feel about not exercising? Do you think you would feel better if you did, or do you feel fine as you are?",
      "Do you think you might start exercising in the future? Why or why not, and what would make you want to start?",
      "What's the biggest challenge you face when you think about starting to exercise?",
      "How do you deal with stress or other health concerns without exercising?",
      "Tell me about a time you tried to start exercising but stopped. What happened?",
      "Do you have a friend or a family member who exercises a lot? How do they influence you?",
      "What's the biggest misconception people have about exercising?",
      "Describe a time you were advised to start exercising by a doctor or a friend.",
      "Do you think exercising is important for your mental health? Why or why not?",
      "How do you think your life would change if you started exercising regularly?",
      "What's the best piece of advice you've received about exercising, even if you haven't followed it?"
    ],
    "domestic business trip": [
      "Tell me about your last domestic business trip. Where did you go, what was the purpose of your trip, and what did you do?",
      "What do you like most about going on business trips? Is it the change of scenery, or meeting new people?",
      "What is the most challenging part of a business trip? Is it being away from home, or dealing with travel logistics?",
      "What's the biggest difference between a business trip and a vacation?",
      "How do you prepare for a business trip? What do you pack?",
      "Tell me about a time you had a problem during a business trip, like a missed flight or a lost bag.",
      "What's the most common destination for your business trips?",
      "Describe a memorable meal you had while on a business trip.",
      "Do you ever have time for sightseeing or personal activities during a business trip?",
      "Tell me about a time you had to give a presentation or a talk during a business trip.",
      "How do you feel when you come back home after a business trip?",
      "What's the best piece of advice you've received about business trips?",
      "How do you feel when you're in a new city for a business trip?",
      "Tell me about a time you had to meet a new client or a new colleague during a business trip.",
      "Do you think business trips are an important part of your job? Why or why not?",
      "What is the most important thing you do to stay connected with your family while you're away?",
      "Describe a time you had a very successful business trip.",
      "What's the biggest difference between traveling for business and traveling for leisure?"
    ],
    "overseas business trip": [
      "Tell me about your last overseas business trip. Where did you go, and what was the purpose of your trip?",
      "What do you like most about going on overseas business trips? Is it the chance to experience a new culture, or the opportunity to travel?",
      "What is the most challenging part of an overseas business trip? Is it the language barrier, the jet lag, or something else?",
      "What's the biggest difference between an overseas business trip and a domestic one?",
      "How do you prepare for an overseas business trip? What kind of documents or items do you need?",
      "Tell me about a time you had a problem during an overseas business trip, like a missed connection or a lost passport.",
      "What's the most common destination for your overseas business trips?",
      "Describe a memorable meal you had in another country while on a business trip.",
      "Do you ever have time for sightseeing or personal activities during an overseas business trip?",
      "Tell me about a time you had to give a presentation or a talk in another country.",
      "How do you feel when you come back home after an overseas business trip?",
      "What's the best piece of advice you've received about overseas business trips?",
      "How do you feel when you're in a new country for a business trip?",
      "Tell me about a time you had to meet a new client or a new colleague in another country.",
      "Do you think overseas business trips are an important part of your job? Why or why not?",
      "What is the most important thing you do to stay connected with your family while you're away?",
      "Describe a time you had a very successful overseas business trip.",
      "What's the biggest difference between traveling for business and traveling for leisure in another country?"
    ],
    "staycation": [
      "When was the last time you had a staycation? What did you do, and who did you spend it with?",
      "What do you like most about staycations? Do you enjoy the comfort of your own home, or the chance to explore your local area?",
      "What is the best part of a staycation? Is it saving money, or not having to deal with the stress of travel?",
      "What's the biggest difference between a staycation and a normal weekend at home?",
      "How do you plan for a staycation? Do you make a list of things to do, or do you just go with the flow?",
      "Tell me about a time you had a problem during a staycation, like getting bored or having to do chores.",
      "What's your favorite thing to do during a staycation? Do you watch movies, cook a nice meal, or go out?",
      "Describe a memorable meal you had during a staycation.",
      "Do you ever have visitors or guests during a staycation?",
      "Tell me about a time you went on a short day trip to a nearby city or town during a staycation.",
      "How do you feel after you've had a staycation?",
      "What's the best piece of advice you've received about staycations?",
      "How do you feel when you're in a new part of your own city during a staycation?",
      "Tell me about a time you rediscovered a part of your city you hadn't been to in a long time.",
      "Do you think staycations are a good way to relax and recharge? Why or why not?",
      "What is the most important thing you do to make your staycation feel special?",
      "Describe a time you had a very relaxing staycation."
    ],
    "domestic travel": [
      "Tell me about the last time you traveled domestically. Where did you go, and what did you do there?",
      "What is your favorite place to travel to in your country? Why do you like it so much, and what activities do you do there?",
      "Tell me about a memorable domestic travel experience you've had. What happened, and who were you with?",
      "What's the biggest difference between traveling domestically by car and by train or plane?",
      "How do you feel when you're traveling domestically?",
      "Tell me about a time you had a problem during a domestic trip, like a lost bag or a hotel booking issue.",
      "What's the most common destination for domestic travelers in your country?",
      "Describe a memorable meal you had while on a domestic trip.",
      "Do you prefer to travel to a city or to a natural area within your country? Why?",
      "Tell me about a time you had to book a last-minute domestic trip.",
      "How do you feel after you've had a domestic trip?",
      "What's the best piece of advice you've received about domestic travel?",
      "How do you feel when you're in a new city within your own country?",
      "Do you think domestic travel is a good way to explore your own culture? Why or why not?",
      "What is the most important thing you pack for a domestic trip?",
      "Describe a time you had a very relaxing domestic trip.",
      "What's the biggest difference between a domestic trip and an international one?"
    ],
    "international travel": [
      "Tell me about the last time you traveled internationally. Where did you go, what did you do there, and what was the culture like?",
      "What is your favorite country to travel to? Why do you like it so much, and what's your favorite thing to do there?",
      "Tell me about a memorable international travel experience you've had. What happened, and what made it so special?",
      "What's the biggest difference between traveling internationally and domestically?",
      "How do you feel when you're in a foreign country?",
      "Tell me about a time you had a problem during an international trip, like a language barrier or a lost passport.",
      "What's the most common destination for international travelers from your country?",
      "Describe a memorable meal you had in another country while on an international trip.",
      "Do you prefer to travel to a country with a similar culture or a very different one? Why?",
      "Tell me about a time you had to use a translation app or a dictionary to communicate in another country.",
      "How do you feel after you've had an international trip?",
      "What's the best piece of advice you've received about international travel?",
      "How do you feel when you're in a new country for the first time?",
      "Do you think international travel is a good way to learn about the world? Why or why not?",
      "What is the most important thing you pack for an international trip?",
      "Describe a time you had a very adventurous international trip."
    ],
    "newspaper": [
      "How often do you read the newspaper? Do you prefer a physical paper or an online version, and what sections do you usually read?",
      "What do you think is the most important role of a newspaper in society? How has this role changed over time, in your opinion?",
      "Tell me about a time you read a newspaper article that had a big impact on you. What was the article about, and how did it affect your perspective?",
      "What's the biggest difference between reading a newspaper and watching the news on TV?",
      "How do you feel when you read the newspaper?",
      "Tell me about a time you were surprised by a news story you read in the newspaper.",
      "What's the most difficult part of reading a newspaper for you?",
      "Describe the atmosphere of a cafe or a public space where people are reading newspapers.",
      "Do you think newspapers are still relevant in today's digital age? Why or why not?",
      "Tell me about a time you talked with a friend or a family member about an article you read in the newspaper.",
      "Tell me about a time you read a newspaper article that was very inspiring to you."
    ],
    "taking photos": [
      "How often do you take photos? What do you usually take pictures of, and do you use a smartphone or a dedicated camera?",
      "What do you think is the most important part of taking a good photo? Is it the lighting, the composition, or the subject itself?",
      "Tell me about a memorable photo you took. What was the photo of, and why is it so special to you?",
      "What's the biggest difference between taking photos with a smartphone and with a professional camera?",
      "How do you feel when you take a really good photo?",
      "Tell me about a time you had to take a photo of something for a special occasion.",
      "What's the most difficult part of taking a photo for you?",
      "Describe the feeling of looking back at old photos you've taken.",
      "Do you think taking photos is a good way to preserve memories? Why or why not?",
      "Tell me about a time you took a photo that you think perfectly captures a moment.",
      "Do you think anyone can be a good photographer with enough practice? Why or why not?"
    ]
  },
  "role_play": {
    "Getting Ready for Traveling": [
      "I’d like to give you a situation and ask you to act it out. Imagine you’re planning a family trip. Call a friend who came back from a trip and ask 3 or 4 questions about the trip you’re planning.",
      "You are planning a trip to a country you've never been to. Call a travel agent and ask for recommendations on where to stay and what to see.",
      "You're going on a business trip and need to book a flight and a hotel. Call a travel agency to make your reservations.",
      "You've been asked to plan a surprise trip for your partner. Call a travel company to get ideas and a quote for a weekend getaway.",
      "You are traveling with a large group and need to rent a van. Call a rental company to inquire about availability and rates.",
      "Imagine you're trying to book a hotel for a family trip. Call the hotel and ask about the amenities, room options, and pricing.",
      "You're planning a hiking trip and need to rent some gear. Call a sports equipment rental store and ask about their available equipment and pricing.",
      "You and your friend are planning a trip, but you can't agree on a destination. Call your friend and try to convince them to go to your preferred location.",
      "You're planning to take a cruise and have some questions about the itinerary and what to pack. Call the cruise company and ask them about the details.",
      "You're trying to book a flight online, but you're having trouble. Call the airline's customer service line and ask for help.",
      "You're planning a trip to a foreign country and need to know about the visa requirements. Call the embassy of that country and ask for information.",
      "You're going on a road trip and need to get your car serviced. Call a mechanic and ask for a check-up and an oil change.",
      "You're planning a trip with a friend and want to know what they want to do. Call your friend and ask them about their preferences for activities and food.",
      "You're trying to book tickets for a concert in another city. Call the ticket office and ask about ticket availability and seating options.",
      "You're going on a trip and need to book a pet sitter. Call a pet sitting service and ask them about their rates and availability.",
      "You're planning a trip to a museum in another city. Call the museum and ask about their opening hours, ticket prices, and current exhibitions.",
      "You're planning a weekend trip and want to know about the weather. Call a local weather station and ask for a forecast.",
      "You're going on a trip and need to change your flight. Call the airline and ask about the process and any fees involved."
    ],
    "Cancelling Appointment": [
      "There’s a problem you must take care of. You were supposed to meet a friend but suddenly something came up and you can’t make it. Call your friend, explain the alternatives to solve this problem.",
      "I'm sorry, but there is a problem you need to resolve. You are planning to go shopping with your friend. But you feel sick. Call your friend and explain the situation. Suggest two or three alternatives.",
      "You have a dentist appointment, but you have a sudden emergency at work. Call the dentist's office to cancel and reschedule.",
      "You were supposed to meet a colleague for lunch to discuss a project, but you have to finish a report. Call your colleague to explain and propose a new time.",
      "You have a job interview, but you woke up with a fever. Call the hiring manager to explain the situation and ask to reschedule.",
      "You promised to help a friend move, but your car broke down. Call your friend to apologize and offer to help in another way.",
      "You have a doctor's appointment, but you have a conflict with another important meeting. Call the doctor's office to cancel and reschedule.",
      "You're supposed to meet your family for dinner, but you have to work late. Call your family and apologize, and suggest a new time for dinner.",
      "You made a reservation at a popular restaurant for a special occasion, but you can't make it. Call the restaurant to cancel and explain the situation.",
      "You are a teacher and have a parent-teacher conference, but you have a family emergency. Call the parent and explain the situation, and suggest a new time.",
      "You are supposed to pick up a friend from the airport, but you have a sudden illness. Call your friend, apologize, and try to find a solution.",
      "You're a personal trainer and have a session with a client, but you feel sick. Call your client, explain the situation, and suggest a new time.",
      "You were supposed to meet a friend at a cafe, but you have a family emergency. Call your friend, apologize, and suggest a new meeting place.",
      "You have a hair appointment, but something came up at work. Call the salon and ask to reschedule.",
      "You have a dog walking appointment, but you feel sick. Call the owner, explain the situation, and try to find an alternative.",
      "You are supposed to give a presentation to a client, but you feel unwell. Call the client, apologize, and ask to reschedule the presentation.",
      "You made plans to go to a movie with a friend, but you have to work late. Call your friend, apologize, and suggest a new activity for another day.",
      "You have a flight to catch, but your ride to the airport cancels on you. Call your friend, explain the situation, and ask for a ride."
    ],
    "Item Purchase": [
      "I’m going to give you a situation and ask you to act it out. Imagine that you want to buy a new smart phone. Call the store and ask 3 or 4 questions about the smart phone.",
      "I'd like to give you a situation for you to act out. You want to go shopping with your friend. Ask 3-4 questions to your friend.",
      "You want to buy a new laptop for school. Call a computer store and ask about the different models, their features, and the prices.",
      "You're looking for a new pair of running shoes. Call a sports store and ask about their available brands, sizes, and any sales they have.",
      "You want to buy a new television for your living room. Call an electronics store and ask about the different sizes, features, and delivery options.",
      "You're trying to buy a birthday present for a friend. Call a gift shop and ask for some recommendations and ideas.",
      "You want to buy a new car. Call a car dealership and ask about the different models, financing options, and test drive availability.",
      "You're looking for a new jacket for the winter. Call a clothing store and ask about the available styles, sizes, and colors.",
      "You want to buy a new camera for your hobby. Call a camera store and ask about the different models, accessories, and pricing.",
      "You're looking for a new refrigerator. Call an appliance store and ask about the different brands, features, and delivery options.",
      "You want to buy a new book you heard about. Call a bookstore and ask if they have it in stock and if you can reserve a copy.",
      "You're looking for a new set of headphones. Call an electronics store and ask about the different brands, features, and prices.",
      "You want to buy some groceries for the week. Call a grocery store and ask about their available products and any special deals they have.",
      "You're looking for a new watch. Call a jewelry store and ask about the different brands, styles, and prices.",
      "You want to buy a new bed for your bedroom. Call a furniture store and ask about the different sizes, materials, and delivery options.",
      "You're looking for a new pair of sunglasses. Call a sunglasses store and ask about the different brands, styles, and prices.",
      "You want to buy a new bicycle. Call a bicycle store and ask about the different models, sizes, and accessories.",
      "You're looking for a new video game. Call a video game store and ask about the different consoles, games, and any upcoming releases."
    ]
  },
  "random_question": {
    "technology": [
      "Nowadays there are all kinds of electronic devices you can buy. What was the latest device that you bought? When did you buy it? Why did you buy it?",
      "What's one piece of technology you can't live without and why?",
      "Tell me about a time when a new piece of technology made your life significantly easier.",
      "What do you think is the biggest disadvantage of modern technology?",
      "How do you keep up with the latest technological trends?",
      "Describe a piece of technology from the past that you miss and why.",
      "What's a technological innovation you're looking forward to in the future?",
      "Do you think technology makes people more connected or more isolated?",
      "Tell me about your experience with social media and how it has changed over time.",
      "How do you feel about the role of artificial intelligence in our daily lives?",
      "What's the most common use of technology in your daily routine?",
      "Tell me about a time you had to deal with a technical problem with your computer or phone. What happened?",
      "What's the biggest difference between technology from your childhood and technology today?",
      "Do you think it's important to be tech-savvy in today's world? Why or why not?",
      "Tell me about a time you used an app or a program that you found to be very helpful.",
      "What's one piece of technology that you think is overrated and why?",
      "Describe a time you used technology to connect with someone far away.",
      "How do you think technology has changed the way we work and study?"
    ],
    "industry": [
      "Tell me about an industry that you think is very important in your country. What is it, and why is it so important?",
      "What's the biggest difference between the industry you're in and another industry that interests you?",
      "How do you think technology has changed the industry you're most familiar with?",
      "Describe a time you learned something new about a particular industry. What was it about?",
      "What kind of job or position do you think is most important in your chosen industry?",
      "Tell me about a time you had to deal with a challenge in your industry. What happened, and how did you overcome it?",
      "What's one thing you would change about a specific industry if you could?"
    ],
    "recycling": [
      "How do you usually recycle in your home or community? Tell me about your recycling routine.",
      "What do you think is the biggest challenge of recycling for most people?",
      "Tell me about a time you tried to recycle something and it was difficult. What was the item?",
      "Do you think recycling is an important part of our daily lives? Why or why not?",
      "What's the biggest difference between recycling now and in the past?",
      "Describe a time you saw a recycling program in another country or city. What was it like?",
      "What's one thing you wish people would recycle more often?"
    ],
    "weather": [
      "What's your favorite kind of weather and why do you like it so much?",
      "Tell me about a memorable experience you had in extreme weather, like a heavy rainstorm or a heatwave.",
      "How do you think the weather has changed in your country over the last 10 years?",
      "What's the biggest difference between the weather in your city and the weather in another city you've visited?",
      "Describe a time when the weather affected your plans. What happened?",
      "Do you think people are more or less prepared for unexpected weather events now? Why?",
      "What's the most common topic you discuss with your friends or family about the weather?"
    ]
  }
}